{
  "_name_or_path": "/common-repos/xLSTM-7b",
  "add_embedding_dropout": false,
  "add_forward_backend_padding": false,
  "add_out_norm": true,
  "add_post_blocks_norm": true,
  "add_post_norm": false,
  "add_qk_norm": false,
  "architectures": [
    "xLSTMForCausalLM"
  ],
  "autocast_kernel_dtype": "bfloat16",
  "bos_token_id": 0,
  "cell_norm_eps": 1e-06,
  "chunk_size": 64,
  "chunkwise_kernel": "chunkwise--triton_xl_chunk",
  "embedding_dim": 2048,
  "eos_token_id": 2,
  "eps": 1e-06,
  "ffn_proj_factor": 2.667,
  "ffn_round_up_to_multiple_of": 64,
  "force_bos_token_insert": true,
  "gate_soft_cap": 15.0,
  "head_dim": 256,
  "igate_bias_init_range": -10.0,
  "inference_state_dtype": "float32",
  "mlstm_round_up_to_multiple_of": 64,
  "mode": "inference",
  "model_type": "xlstm",
  "norm_eps": 1e-06,
  "norm_reduction_force_float32": true,
  "num_blocks": 16,
  "num_heads": 8,
  "output_logit_soft_cap": 30.0,
  "pad_token_id": 1,
  "qk_dim_factor": 0.5,
  "return_last_states": true,
  "sequence_kernel": "native_sequence__triton",
  "step_kernel": "triton",
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0.dev0",
  "use_bias": false,
  "use_cache": true,
  "v_dim_factor": 1.0,
  "vocab_size": 51200,
  "weight_mode": "single"
}
